In [1]:
# Pandas in Depth
import pandas as pd
import numpy as np
import matplotlib.pyplot as py
pd.set_option('max_columns', 50)
%matplotlib inline

In [2]:
d = { 'india' : 100, 'Sri Lanka' : 200, 'Pakistan' : 120}

In [3]:
d

{'Pakistan': 120, 'Sri Lanka': 200, 'india': 100}

In [4]:
d = pd.Series(d)

In [5]:
d

Pakistan     120
Sri Lanka    200
india        100
dtype: int64

In [6]:
type(d)

pandas.core.series.Series

In [7]:
d['india'], d['Sri Lanka']

(100, 200)

In [8]:
d[d > 100]

Pakistan     120
Sri Lanka    200
dtype: int64

In [9]:
d[d > 120]

Sri Lanka    200
dtype: int64

In [10]:
d['india'] = 2000

In [11]:
d['india']

2000

In [12]:
print('india' in d)

True

In [13]:
d * 10

Pakistan      1200
Sri Lanka     2000
india        20000
dtype: int64

In [14]:
np.square(d)

Pakistan       14400
Sri Lanka      40000
india        4000000
dtype: int64

In [15]:
d

Pakistan      120
Sri Lanka     200
india        2000
dtype: int64

In [16]:
data = {'year' : [2010, 2011, 2012, 2013],
       'team' : ['Bears', 'Bears', 'Bears', 'Lions'],
       'losses' : [2, 3, 4, 5],
       'win' : [12, 23, 34, 10]}

In [17]:
data = pd.DataFrame(data, columns=['year', 'team', 'losses', 'win'])

In [18]:
data

   year   team  losses  win
0  2010  Bears       2   12
1  2011  Bears       3   23
2  2012  Bears       4   34
3  2013  Lions       5   10

In [19]:
import os
os.getcwd()

'/home/genius'

In [20]:
!head -n 5 baby_names_reduced.csv

Year,First Name,County,Sex,Count
2013,DAVID,KINGS,M,272
2013,JAYDEN,KINGS,M,268
2013,JAYDEN,QUEENS,M,219
2013,MOSHE,KINGS,M,219

In [21]:
from pandas.io import sql
import sqlite3

In [25]:
url = 'https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv'

In [26]:
!head -n 5 url

head: cannot open 'url' for reading: No such file or directory

In [27]:
from_url = pd.read_table(url, sep='\t')

In [28]:
!head -n 5 from_url

head: cannot open 'from_url' for reading: No such file or directory

In [40]:
from_url.head(5)

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925
3,4,Roast Beef,Al&rsquo;s Deli,"The Francophile brothers behind this deli, whi...",$9.40.,914 Noyes St.,Evanston,NaN,alsdeli.net,"914 Noyes St., Evanston","914 Noyes Street, Evanston, IL 60201, USA",42.058442,-87.684425
4,5,PB&amp;L,Publican Qualty Meats,"When this place opened in February, it quickly...",$10,825 W. Fulton Mkt.,Chicago,312-445-8977,publicanqualitymeats.com,"825 W. Fulton Mkt., Chicago","825 West Fulton Market, Chicago, IL 60607, USA",41.886637,-87.648553

In [41]:
from_url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 13 columns):
rank                 61 non-null int64
sandwich             61 non-null object
restaurant           61 non-null object
description          61 non-null object
price                61 non-null object
address              61 non-null object
city                 61 non-null object
phone                50 non-null object
website              58 non-null object
full_address         61 non-null object
formatted_address    61 non-null object
lat                  61 non-null float64
lng                  61 non-null float64
dtypes: float64(2), int64(1), object(10)
memory usage: 6.3+ KB

In [42]:
from_url.dtypes

rank                   int64
sandwich              object
restaurant            object
description           object
price                 object
address               object
city                  object
phone                 object
website               object
full_address          object
formatted_address     object
lat                  float64
lng                  float64
dtype: object

In [43]:
from_url.describe()

            rank        lat        lng
count  61.000000  61.000000  61.000000
mean   25.278689  41.906938 -87.682965
std    13.689572   0.083674   0.090901
min     1.000000  41.601541 -88.125653
25%    13.000000  41.884672 -87.684425
50%    25.000000  41.898990 -87.648218
75%    36.000000  41.930101 -87.634157
max    50.000000  42.251828 -87.593820

In [60]:
# Data
# To get the data of MovieLense 
# 'http://files.grouplens.org/datasets/movielens/ml-100k.zip'

In [32]:
os.getcwd()

'/home/genius'

In [33]:
os.chdir('/home/genius/Python_Test/ml-100k')

In [34]:
os.getcwd()

'/home/genius/Python_Test/ml-100k'

In [35]:
!head -n 5 u.data

196	242	3	881250949
186	302	3	891717742
22	377	1	878887116
244	51	2	880606923
166	346	1	886397596

In [36]:
!head -n 5 u.user

1|24|M|technician|85711
2|53|F|other|94043
3|23|M|writer|32067
4|24|M|technician|43537
5|33|F|other|15213

In [37]:
# pass in coloumns names for each CSV
u_cols = ['user_id','age','sex', 'occupation', 'zip_code']
users = pd.read_csv('u.user', sep = '|', names=u_cols, encoding='latin-1')

In [91]:
unq_occu = users['occupation'].unique()

In [92]:
unq_occu

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'], dtype=object)

In [38]:
! head -n 5 u.data

196	242	3	881250949
186	302	3	891717742
22	377	1	878887116
244	51	2	880606923
166	346	1	886397596

In [39]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
rating = pd.read_csv('u.data', sep = '\t', names = r_cols, encoding = 'latin-1')

In [40]:
!head -n 5 u.item

1|Toy Story (1995)|01-Jan-1995||http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)|0|0|0|1|1|1|0|0|0|0|0|0|0|0|0|0|0|0|0
2|GoldenEye (1995)|01-Jan-1995||http://us.imdb.com/M/title-exact?GoldenEye%20(1995)|0|1|1|0|0|0|0|0|0|0|0|0|0|0|0|0|1|0|0
3|Four Rooms (1995)|01-Jan-1995||http://us.imdb.com/M/title-exact?Four%20Rooms%20(1995)|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|1|0|0
4|Get Shorty (1995)|01-Jan-1995||http://us.imdb.com/M/title-exact?Get%20Shorty%20(1995)|0|1|0|0|0|1|0|0|1|0|0|0|0|0|0|0|0|0|0
5|Copycat (1995)|01-Jan-1995||http://us.imdb.com/M/title-exact?Copycat%20(1995)|0|0|0|0|0|0|1|0|1|0|0|0|0|0|0|0|1|0|0

In [41]:
# Movie file contains columns indicating movies genres 
# Let only load the first 5 columns of the file using argument 'usecols'
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('u.item', sep = "|", names = m_cols, usecols = range(5), encoding = 'latin-1')

In [42]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

In [43]:
users.head()
#print(users[['age', 'zip_code']].head())

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [44]:
users.head()
# can also store in a variable to use later 
columns_you_want = ['occupation', 'sex']
print(users[columns_you_want].head())

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [45]:
# user older than 25
print(users[users.age > 25].head(3))
print('\n')
# Users aged 40 AND male
print(users[(users.age == 40) & (users.sex == 'M')].head(3))
print('\n')
# user younger than 30 OR female
print(users[(users.sex == 'F') | (users.age < 30)].head(3))

   user_id  age sex occupation zip_code
1        2   53   F      other    94043
4        5   33   F      other    15213
5        6   42   M  executive    98101


     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232


   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067

In [46]:
#If you want to modify your existing DataFrame, use the inplace parameter. 
#Most DataFrame methods return new a DataFrames, while offering an inplace parameter.
#Note that the inplace version might not actually be any more efficint (in terms of speed or memory usage) 
#that the regular version.
## It make to lost the default 0-based index and moved the user_id into place.
users.set_index('user_id', inplace = True)
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [47]:
# Select the row using iloc method -- positions
print(users.iloc[99])
print("\n")
print(users.iloc[[1, 50, 300]])

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object


         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

In [48]:
# Select the rows by label with the loc method
print(users.loc[90])
print('\n')
print(users.loc[[1, 30, 45]])

age                 60
sex                  M
occupation    educator
zip_code         78155
Name: 90, dtype: object


         age sex  occupation zip_code
user_id
1         24   M  technician    85711
30         7   M     student    55436
45        29   M  programmer    50233

In [49]:
# To reset Index of the old pandas i.e default valus
users.reset_index(inplace = True)

In [50]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [130]:
#The simplified rules of indexing are

#    Use loc for label-based indexing
#    Use iloc for positional indexing

In [53]:
# Joining the DataFrame use pandas.merge function
# pandas.merge allows two DataFrames to be joined on one or more keys.
# The function provides a series of parameters (on, left_on, right_on, left_index, right_index) 
#allowing you to specify the columns or indexes on which to join.
# By default, pandas.merge operates as an inner join, which can be changed using the how parameter.
#     how : {'left', 'right', 'outer', 'inner'}, default 'inner'

        # left: use only keys from left frame (SQL: left outer join)

        # right: use only keys from right frame (SQL: right outer join)

        # outer: use union of keys from both frames (SQL: full outer join)

        # inner: use intersection of keys from both frames (SQL: inner join)'''''

In [55]:
# Some Example on Join
left_frame = pd.DataFrame({'keys' : range(5),
                           'left_value' : ['a', 'b', 'c', 'd', 'e']}                
                           )

In [60]:
right_frame = pd.DataFrame({'keys': range(2,7),
                           'right_value' : ['f', 'g', 'h', 'i', 'j']}
                                            )

In [61]:
print(left_frame)
print("\n")
print(right_frame)

   keys left_value
0     0          a
1     1          b
2     2          c
3     3          d
4     4          e


   keys right_value
0     2           f
1     3           g
2     4           h
3     5           i
4     6           j

In [63]:
#   inner join (default)
pd.merge(left_frame, right_frame, on='keys', how='inner')

   keys left_value right_value
0     2          c           f
1     3          d           g
2     4          e           h

In [ ]:
# We lose values from both frames since certain keys do not match up.

In [65]:
# left outer join
pd.merge(left_frame, right_frame, on = 'keys', how = 'left')

   keys left_value right_value
0     0          a         NaN
1     1          b         NaN
2     2          c           f
3     3          d           g
4     4          e           h

In [ ]:
# We keep everything from the left frame, pulling in the value from the right frame where the keys match up. 
# The right_value is NULL where keys do not match (NaN).

In [67]:
# right Outer Join
pd.merge(left_frame, right_frame, on = 'keys', how = 'right')

   keys left_value right_value
0   2.0          c           f
1   3.0          d           g
2   4.0          e           h
3   5.0        NaN           i
4   6.0        NaN           j

In [ ]:
# This time we've kept everything from the right frame with the left_value being NULL where 
# the right frame's key did not find a match.

In [68]:
# Full outer join
pd.merge(left_frame, right_frame, on = 'keys', how = 'outer')

   keys left_value right_value
0   0.0          a         NaN
1   1.0          b         NaN
2   2.0          c           f
3   3.0          d           g
4   4.0          e           h
5   5.0        NaN           i
6   6.0        NaN           j

In [69]:
# We've kept everything from both frames, regardless of whether or not there was a match on both sides.
# Where there was not a match, the values corresponding to that key are NULL.

In [70]:
#  Combining
# pandas also provides a way to combine DataFrames along an axis - pandas.concat.
# While the function is equivalent to SQL's UNION clause, there's a lot more that can be done with it.

In [71]:
# Input - pandas.concat takes a list of Series or DataFrames 
# Output - a Series or DataFrame of the concatenated objects.
# Note that because the function takes list, you can combine many objects at once.

In [72]:
pd.concat([left_frame, right_frame])

   keys left_value right_value
0     0          a         NaN
1     1          b         NaN
2     2          c         NaN
3     3          d         NaN
4     4          e         NaN
0     2        NaN           f
1     3        NaN           g
2     4        NaN           h
3     5        NaN           i
4     6        NaN           j

In [73]:
# By default, the function will vertically append the objects to one another, 
# combining columns with the same name. We can see above that values not matching up will be NULL.

In [74]:
# concatentated side-by-side using the function's axis parameter.
pd.concat([left_frame, right_frame], axis=1)

   keys left_value  keys right_value
0     0          a     2           f
1     1          b     3           g
2     2          c     4           h
3     3          d     5           i
4     4          e     6           j

In [75]:
# Grouping WOP